---
kind: property
id: P:Autodesk.Revit.DB.LinkElementId.LinkInstanceId
source: html/4d0358df-6aaa-53b0-ebe0-365cba628f03.htm
---
# Autodesk.Revit.DB.LinkElementId.LinkInstanceId Property

The id of the link, or invalidElementId if no link.

## Syntax (C#)
```csharp
public ElementId LinkInstanceId { get; }
```